name: "${NET_ID}"

layer {
  name: "data"
  type: "ImageSegData"
  top: "data"
  image_data_param {
    root_folder: "${DATA_ROOT}"
    source: "${EXP}/list/${TEST_SET}.txt"
    batch_size: 1
    label_type: NONE
  }
  transform_param {
    mean_value: 104.008
    mean_value: 116.669
    mean_value: 122.675
    crop_size: 513
    mirror: false
  }
  include: { phase: TEST }
}

#### BEG (0) Direct path to classifier
layer {
  bottom: "data"
  top: "data_conv"
  name: "data_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { bottom: 'data_conv' top: 'data_conv' name: 'bn_data_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "data_conv"
  top: "data_conv"
  name: "relu_data_conv"
  type: "ReLU"
}

layer {
  bottom: "data_conv"
  top: "data_fc"
  name: "data_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { bottom: 'data_fc' top: 'data_fc' name: 'bn_data_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "data_fc"
  top: "data_fc"
  name: "relu_data_fc"
  type: "ReLU"
}
layer {
  bottom: "data_fc"
  top: "data_ms"
  name: "data_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (0) Direct path to classifier

############################## NETWORK ##########################
# conv1_1
layer {  bottom: "data"  top: "conv1_1"  name: "conv1_1"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 64    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv1_1' top: 'conv1_1' name: 'bn1_1' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }


layer {  bottom: "conv1_1"  top: "conv1_1"  name: "relu1_1"  type: "ReLU"}

# conv1_2
layer {  bottom: "conv1_1"  top: "conv1_2"  name: "conv1_2"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 64    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv1_2' top: 'conv1_2' name: 'bn1_2' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }


layer {  bottom: "conv1_2"  top: "conv1_2"  name: "relu1_2"  type: "ReLU"}

# pool1
layer {
  bottom: "conv1_2"  top: "pool1" top:"pool1_mask"  name: "pool1"  type: "Pooling"
  pooling_param {    pool: MAX    kernel_size: 3 pad: 1    stride: 2  }
}

# BEG (1) Direct path to classifier
layer {
  bottom: "pool1"
  top: "pool1_conv"
  name: "pool1_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride:1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool1_conv' top: 'pool1_conv' name: 'bn_pool1_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool1_conv"
  top: "pool1_conv"
  name: "relu_pool1_conv"
  type: "ReLU"
}
layer {
  bottom: "pool1_conv"
  top: "pool1_fc"
  name: "pool1_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { bottom: 'pool1_fc' top: 'pool1_fc' name: 'bn_pool1_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool1_fc"
  top: "pool1_fc"
  name: "relu_pool1_fc"
  type: "ReLU"
}
layer {
  bottom: "pool1_fc"
  top: "pool1_ms"
  name: "pool1_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (1) Direct path to classifier

# 112 x 112
# conv2_1
layer {  bottom: "pool1"  top: "conv2_1"  name: "conv2_1"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 128    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv2_1' top: 'conv2_1' name: 'bn2_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }


layer {  bottom: "conv2_1"  top: "conv2_1"  name: "relu2_1"  type: "ReLU"}
# conv2_2
layer {  bottom: "conv2_1"  top: "conv2_2"  name: "conv2_2"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 128    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv2_2' top: 'conv2_2' name: 'bn2_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv2_2"  top: "conv2_2"  name: "relu2_2"  type: "ReLU"}

# pool2
layer {
  bottom: "conv2_2"  top: "pool2" top: "pool2_mask" name: "pool2"  type: "Pooling"
  pooling_param {    pool: MAX    kernel_size: 3 pad: 1    stride: 2  }
}

# BEG (2) Direct path to classifier
layer {
  bottom: "pool2"
  top: "pool2_conv"
  name: "pool2_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool2_conv' top: 'pool2_conv' name: 'bn_pool2_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool2_conv"
  top: "pool2_conv"
  name: "relu_pool2_conv"
  type: "ReLU"
}
layer {
  bottom: "pool2_conv"
  top: "pool2_fc"
  name: "pool2_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { bottom: 'pool2_fc' top: 'pool2_fc' name: 'bn_pool2_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool2_fc"
  top: "pool2_fc"
  name: "relu_pool2_fc"
  type: "ReLU"
}
layer {
  bottom: "pool2_fc"
  top: "pool2_ms"
  name: "pool2_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (2) Direct path to classifier

# 56 x 56
# conv3_1
layer {  bottom: "pool2"  top: "conv3_1"  name: "conv3_1"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 256    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv3_1' top: 'conv3_1' name: 'bn3_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv3_1"  top: "conv3_1"  name: "relu3_1"  type: "ReLU"}
# conv3_2
layer {  bottom: "conv3_1"  top: "conv3_2"  name: "conv3_2"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 256    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv3_2' top: 'conv3_2' name: 'bn3_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv3_2"  top: "conv3_2"  name: "relu3_2"  type: "ReLU"}
# conv3_3
layer {  bottom: "conv3_2"  top: "conv3_3"  name: "conv3_3"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 256    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv3_3' top: 'conv3_3' name: 'bn3_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv3_3"  top: "conv3_3"  name: "relu3_3"  type: "ReLU"}

# pool3
layer {
  bottom: "conv3_3"  top: "pool3" top: "pool3_mask"  name: "pool3"  type: "Pooling"
  pooling_param {    pool: MAX    kernel_size: 3 pad: 1    stride: 2  }
}

# BEG (3) Direct path to classifier
layer {
  bottom: "pool3"
  top: "pool3_conv"
  name: "pool3_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool3_conv' top: 'pool3_conv' name: 'bn_pool3_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool3_conv"
  top: "pool3_conv"
  name: "relu_pool3_conv"
  type: "ReLU"
}
layer {
  bottom: "pool3_conv"
  top: "pool3_fc"
  name: "pool3_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { bottom: 'pool3_fc' top: 'pool3_fc' name: 'bn_pool3_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool3_fc"
  top: "pool3_fc"
  name: "relu_pool3_fc"
  type: "ReLU"
}
layer {
  bottom: "pool3_fc"
  top: "pool3_ms"
  name: "pool3_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (3) Direct path to classifier

# 28 x 28
# conv4_1
layer {  bottom: "pool3"  top: "conv4_1"  name: "conv4_1"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv4_1' top: 'conv4_1' name: 'bn4_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv4_1"  top: "conv4_1"  name: "relu4_1"  type: "ReLU"}
# conv4_2
layer {  bottom: "conv4_1"  top: "conv4_2"  name: "conv4_2"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv4_2' top: 'conv4_2' name: 'bn4_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv4_2"  top: "conv4_2"  name: "relu4_2"  type: "ReLU"}
# conv4_3
layer {  bottom: "conv4_2"  top: "conv4_3"  name: "conv4_3"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv4_3' top: 'conv4_3' name: 'bn4_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv4_3"  top: "conv4_3"  name: "relu4_3"  type: "ReLU"}

# pool4
layer {
  bottom: "conv4_3"  top: "pool4" top: "pool4_mask"  name: "pool4"  type: "Pooling"
  pooling_param {    pool: MAX    kernel_size: 3 pad: 1    stride: 2  }
}

# BEG (4) Direct path to classifier
layer {
  bottom: "pool4"
  top: "pool4_conv"
  name: "pool4_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool4_conv' top: 'pool4_conv' name: 'bn_pool4_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }

layer {
  bottom: "pool4_conv"
  top: "pool4_conv"
  name: "relu_pool4_conv"
  type: "ReLU"
}
layer {
  bottom: "pool4_conv"
  top: "pool4_fc"
  name: "pool4_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool4_fc' top: 'pool4_fc' name: 'bn_pool4_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }
layer {
  bottom: "pool4_fc"
  top: "pool4_fc"
  name: "relu_pool4_fc"
  type: "ReLU"
}
layer {
  bottom: "pool4_fc"
  top: "pool4_ms"
  name: "pool4_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (4) Direct path to classifier

# 14 x 14
# conv5_1
layer {  bottom: "pool4"  top: "conv5_1"  name: "conv5_1"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv5_1' top: 'conv5_1' name: 'bn5_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv5_1"  top: "conv5_1"  name: "relu5_1"  type: "ReLU"}
# conv5_2
layer {  bottom: "conv5_1"  top: "conv5_2"  name: "conv5_2"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv5_2' top: 'conv5_2' name: 'bn5_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv5_2"  top: "conv5_2"  name: "relu5_2"  type: "ReLU"}
# conv5_3
layer {  bottom: "conv5_2"  top: "conv5_3"  name: "conv5_3"  type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param {    num_output: 512    pad: 1    kernel_size: 3  }}

layer { bottom: 'conv5_3' top: 'conv5_3' name: 'bn5_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "conv5_3"  top: "conv5_3"  name: "relu5_3"  type: "ReLU"}

# pool5
layer {
  bottom: "conv5_3"  top: "pool5" top: "pool5_mask"  name: "pool5"  type: "Pooling"
  pooling_param {    pool: MAX    kernel_size: 3 pad: 1    stride: 2  }
}

# BEG (5) Direct path to classifier
layer {
  bottom: "pool5"
  top: "pool5_conv"
  name: "pool5_conv"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool5_conv' top: 'pool5_conv' name: 'bn_pool5_conv' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }
layer {
  bottom: "pool5_conv"
  top: "pool5_conv"
  name: "relu_pool5_conv"
  type: "ReLU"
}
layer {
  bottom: "pool5_conv"
  top: "pool5_fc"
  name: "pool5_fc"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer { bottom: 'pool5_fc' top: 'pool5_fc' name: 'bn_pool5_fc' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
            } }
layer {
  bottom: "pool5_fc"
  top: "pool5_fc"
  name: "relu_pool5_fc"
  type: "ReLU"
}
layer {
  bottom: "pool5_fc"
  top: "pool5_ms"
  name: "pool5_ms"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: ${NUM_LABELS}
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# END (5) Direct path to classifier


# 7 x 7 x 4096 -> 3 x 3 x 1024
# fc6
layer { bottom: 'pool5' top: 'fc6' name: 'fc6' type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 3 num_output: 1024 pad: 1} }

layer { bottom: 'fc6' top: 'fc6' name: 'bnfc6' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "fc6"  top: "fc6"  name: "relu6"  type: "ReLU"}

# 1 x 1 x 4096 -> 1 x 1 x 1024
# fc7
layer { bottom: 'fc6' top: 'fc7' name: 'fc7' type: "Convolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 1 num_output: 1024 } }

layer { bottom: 'fc7' top: 'fc7' name: 'bnfc7' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer {  bottom: "fc7"  top: "fc7"  name: "relu7"  type: "ReLU"}

# kernel_size 3 -> 3
# fc6-deconv
layer { bottom: 'fc7' top: 'fc6-deconv' name: 'fc6-deconv' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512 kernel_size: 3 pad: 1}}

layer { bottom: 'fc6-deconv' top: 'fc6-deconv' name: 'fc6-deconv-bn' type: "BatchNorm" 
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'fc6-deconv' top: 'fc6-deconv' name: 'fc6-deconv-relu' type: "ReLU" }

# 7 x 7
# unpool5
layer { type: "Unpooling"  bottom: "fc6-deconv"  bottom: "pool5_mask"  top: "unpool5"  name: "unpool5"
  unpooling_param {   unpool: MAX   kernel_size: 3 pad: 1    stride: 2   unpool_size: 0 }
}

# 14 x 14
# deconv5_1
layer { bottom: 'unpool5' top: 'deconv5_1' name: 'deconv5_1' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv5_1' top: 'deconv5_1' name: 'debn5_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv5_1' top: 'deconv5_1' name: 'derelu5_1' type: "ReLU" }
# deconv5_2
layer { bottom: 'deconv5_1' top: 'deconv5_2' name: 'deconv5_2' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv5_2' top: 'deconv5_2' name: 'debn5_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv5_2' top: 'deconv5_2' name: 'derelu5_2' type: "ReLU" }
# deconv5_3
layer { bottom: 'deconv5_2' top: 'deconv5_3' name: 'deconv5_3' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv5_3' top: 'deconv5_3' name: 'debn5_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv5_3' top: 'deconv5_3' name: 'derelu5_3' type: "ReLU" }

# unpool4
layer { type: "Unpooling"  bottom: "deconv5_3"  bottom: "pool4_mask"  top: "unpool4"  name: "unpool4"
  unpooling_param {   unpool: MAX   kernel_size: 3 pad: 1    stride: 2   unpool_size: 0 }
}

# 28 x 28
# deconv4_1
layer { bottom: 'unpool4' top: 'deconv4_1' name: 'deconv4_1' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv4_1' top: 'deconv4_1' name: 'debn4_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv4_1' top: 'deconv4_1' name: 'derelu4_1' type: "ReLU" }
# deconv 4_2
layer { bottom: 'deconv4_1' top: 'deconv4_2' name: 'deconv4_2' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 512	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv4_2' top: 'deconv4_2' name: 'debn4_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv4_2' top: 'deconv4_2' name: 'derelu4_2' type: "ReLU" }
# deconv 4_3
layer { bottom: 'deconv4_2' top: 'deconv4_3' name: 'deconv4_3' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output: 256	pad: 1	kernel_size: 3}}

layer { bottom: 'deconv4_3' top: 'deconv4_3' name: 'debn4_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv4_3' top: 'deconv4_3' name: 'derelu4_3' type: "ReLU" }

# unpool3
layer { type: "Unpooling"  bottom: "deconv4_3"  bottom: "pool3_mask"  top: "unpool3"  name: "unpool3"
  unpooling_param {   unpool: MAX   kernel_size: 3 pad: 1    stride: 2   unpool_size: 0 }
}

# 56 x 56
# deconv3_1
layer { bottom: 'unpool3' top: 'deconv3_1' name: 'deconv3_1' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:256	pad:1	kernel_size: 3}}

layer { bottom: 'deconv3_1' top: 'deconv3_1' name: 'debn3_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv3_1' top: 'deconv3_1' name: 'derelu3_1' type: "ReLU" }
# deconv3_2
layer { bottom: 'deconv3_1' top: 'deconv3_2' name: 'deconv3_2' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:256	pad:1	kernel_size: 3}}

layer { bottom: 'deconv3_2' top: 'deconv3_2' name: 'debn3_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv3_2' top: 'deconv3_2' name: 'derelu3_2' type: "ReLU" }
# deconv3_3
layer { bottom: 'deconv3_2' top: 'deconv3_3' name: 'deconv3_3' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:128	pad:1	kernel_size: 3}}

layer { bottom: 'deconv3_3' top: 'deconv3_3' name: 'debn3_3' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv3_3' top: 'deconv3_3' name: 'derelu3_3' type: "ReLU" }

# unpool2
layer { type: "Unpooling"  bottom: "deconv3_3"  bottom: "pool2_mask"  top: "unpool2"  name: "unpool2"
  unpooling_param {   unpool: MAX   kernel_size: 3 pad: 1    stride: 2   unpool_size: 0 }
}

# 112 x 112
# deconv2_1
layer { bottom: 'unpool2' top: 'deconv2_1' name: 'deconv2_1' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:128	pad:1	kernel_size: 3}}

layer { bottom: 'deconv2_1' top: 'deconv2_1' name: 'debn2_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv2_1' top: 'deconv2_1' name: 'derelu2_1' type: "ReLU" }
# deconv2_2
layer { bottom: 'deconv2_1' top: 'deconv2_2' name: 'deconv2_2' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:64	pad:1	kernel_size: 3}}

layer { bottom: 'deconv2_2' top: 'deconv2_2' name: 'debn2_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv2_2' top: 'deconv2_2' name: 'derelu2_2' type: "ReLU" }

# unpool1
layer { type: "Unpooling"  bottom: "deconv2_2"  bottom: "pool1_mask"  top: "unpool1"  name: "unpool1"
  unpooling_param {   unpool: MAX   kernel_size: 3 pad: 1    stride: 2   unpool_size: 0 }
}

# deconv1_1
layer { bottom: 'unpool1' top: 'deconv1_1' name: 'deconv1_1' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:64	pad:1	kernel_size: 3}}

layer { bottom: 'deconv1_1' top: 'deconv1_1' name: 'debn1_1' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv1_1' top: 'deconv1_1' name: 'derelu1_1' type: "ReLU" }

# deconv1_2
layer { bottom: 'deconv1_1' top: 'deconv1_2' name: 'deconv1_2' type: "Deconvolution"
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { num_output:64     pad:1   kernel_size: 3}}

layer { bottom: 'deconv1_2' top: 'deconv1_2' name: 'debn1_2' type: "BatchNorm"
  bn_param { scale_filler { type: 'constant' value: 1 }
             shift_filler { type: 'constant' value: 0.001 }
              } }

layer { bottom: 'deconv1_2' top: 'deconv1_2' name: 'derelu1_2' type: "ReLU" }

################ seg-score #################
## resolution : 1
layer { 
  bottom: 'deconv1_2' 
  top: 'seg_score_${EXP}'
  name: 'seg_score_${EXP}' 
  type: "Convolution" 
  param {lr_mult: 0 decay_mult: 1}
  param {lr_mult: 0 decay_mult: 0}
  convolution_param { 
    num_output: ${NUM_LABELS} 
    kernel_size: 1 
  }
}

####### Upsampling
layer {
  bottom: "pool1_ms"
  top: "pool1_interp"
  name: "pool1_interp"
  type: "Interp"
  interp_param {
    zoom_factor: 2
  }
}
layer {
  bottom: "pool2_ms"
  top: "pool2_interp"
  name: "pool2_interp"
  type: "Interp"
  interp_param {
    zoom_factor: 4
  }
}
layer {
  bottom: "pool3_ms"
  top: "pool3_interp"
  name: "pool3_interp"
  type: "Interp"
  interp_param {
    zoom_factor: 8
  }
}
layer {
  bottom: "pool4_ms"
  top: "pool4_interp"
  name: "pool4_interp"
  type: "Interp"
  interp_param {
    zoom_factor: 16
  }
}

layer {
  bottom: "pool5_ms"
  top: "pool5_interp"
  name: "pool5_interp"
  type: "Interp"
  interp_param {
    zoom_factor: 32
  }
}

####### fusion ########
layer {
  bottom: "data_ms"
  bottom: "pool1_interp"
  bottom: "pool2_interp"
  bottom: "pool3_interp"
  bottom: "pool4_interp"
  bottom: "pool5_interp"
  bottom: "seg_score_${EXP}"
  top: "seg_score_fusion"
  name: "seg_score_fusion"
  type: "Eltwise"
  eltwise_param {
    operation: SUM
  }
}

####### save result
layer {
  name: "argmax"
  type: "ArgMax"
  bottom: "seg_score_fusion"
  top: "seg_score_argmax"
}

layer {
  name: "seg_score_mat"
  type: "MatWrite"
  bottom: "seg_score_argmax"
  mat_write_param {
    prefix: "${FEATURE_DIR}/${TEST_SET}/seg_score/"
    source: "${EXP}/list/${TEST_SET}_id.txt"
    strip: 0
    period: 1
  }
  include: { phase: TEST }
}

